// ============================================================
// FILE: data.js (Updated with Corrections)
// ============================================================
const articles = [
    {
        id: 'masjid-quba',
        topic: 'history',
        keywords: 'മസ്ജിദു ഖുബാ',
        title: 'മസ്ജിദു ഖുബാ',
        images: [
            'https://drive.google.com/uc?id=1HNtFfy83wJlWelX5J8MYsEfDaKOoCYo2',
            'https://drive.google.com/uc?id=1Ca7n24HD4ALyGy9_rBZI6mVsfMhy0WrX'
        ],
        notes: `
            <P>ഖുർആൻ പരിചയപ്പെടുത്തിയ തഖ്‌വയിൽ അടിത്തറ പാകിയ ആദ്യ പള്ളിയാണ് മസ്ജിദു ഖുബാ. നിസ്‌കാരത്തിന് ഉംറയുടെ പ്രതിഫലമുള്ള പള്ളിയാണത്. നബി(സ) എല്ലാ ശനിയാഴ്‌ചകളിലും കാൽ നടയായൊ വാഹനപ്പുറമേറിയൊ ഖുബായിൽ എത്തിയിരുന്നു. അതിനാൽ ശനിയാഴ്ചകളിൽ ശക്തമായ തിരിക്കായിരിക്കും ഇവിടെ.
ഖുബാ പള്ളി നിർമിക്കുന്നതിന് മുമ്പ് ഈ സ്ഥലം കുൽസൂമ്ബ്നു ഹദ്‌മിൻ്റേതായിരുന്നു. കാരക്ക ഉണക്കാനിടുന്ന സ്ഥലമായിരുന്നു ഇത്. മുത്ത് നബി(സ) അത് വാങ്ങുകയും മസ്‌ജിദിന് തറക്കല്ലിടുകയും ചെയ്തു. നബി (സ്വ)യുടെ മദീനാഗമനത്തിന് ശേഷം ആദ്യം മരണപ്പെട്ട അൻസ്വാരിയാണ് അദ്ദേഹം. റബീഉൽ അവ്വൽ 12 തിങ്കളാഴ്‌ച മസ്‌ജിദുൽ ഖുബാഇന് തറക്കല്ലിട്ട വ്യാഴാഴ്ച‌ വരെ അവിടെ താമസിച്ചു. മുആദുബ്‌നു ജബൽ(റ)വിനെ അവിടെ ഇമാമായി നിർത്തിയിരുന്നു.നബി (സ്വ)യുടെ വിയോഗശേഷം ഉമർ (റ) ഇത് പുതുക്കിപ്പണിതിട്ടുണ്ട്. ശേഷം ഉസ്‌മാൻ (റ) തെക്ക് ഖിബ്‌ലയുടെ ഭാഗത്തേക്ക് കുറേ സ്ഥലങ്ങൾ കൂട്ടിച്ചേർത്ത് വികസിപ്പിച്ചു.</P><P> ഹിജ്റ 87-ാം വർഷം ഉമറുബ്‌നു അബ്ദിൽ അസീസ് ഇത് പുനർനിർമാണം നടത്തി. പിന്നീട് ഹിജ്റ 555ൽ നൂറുദ്ദീൻ സിൻഖിയുടെ മന്ത്രിയായിരുന്ന ജമാലുദ്ദീനും ഇതിൻ്റെ നീളം വർധിപ്പിച്ചു. 22 മുഴം നീളമുള്ള മിനാരവും അതിൻ്റെ തലഭാഗത്ത് 10 മുഴം വലിപ്പമുള്ള ഖുബ്ബയും പണികഴിപ്പിച്ചു. ഈയടുത്ത് ഹിജ്റ 1405ൽ ഫഹദ് രാജാവ് ഈ പള്ളി പുനർനിർമാണം നടത്തി. പള്ളിയുടെ മൊത്തം വിസ്തൃതി ഏകദേശം 13500 ച.മീറ്ററാണ്. പള്ളിയിലും മുറ്റത്തുമായി 20000 ആളുകൾക്ക് ഒരേസമയം നിസ്‌കരിക്കാനുള്ള സൗകര്യമുണ്ട്. ഖുബാ പള്ളിക്കടുത്ത് ബിഅ്റ് അരീസ് എന്ന കിണറുണ്ടായിരുന്നുവെന്നും അതിലെ വെള്ളം കുടിക്കലും വുളൂഅ് എടുക്കലും സുന്നത്താണെന്ന് ഉദ്ധരിക്കപ്പെട്ടിട്ടുണ്ട്. കിണർ ഇപ്പോൾ കാണാൻ സാധിക്കില്ലെങ്കിലും നിലനിന്നിരുന്നയിടം ഇപ്പോഴും കാണാം.
മസ്‌ജിദുൽ ഖുബാഇൽ നബി (സ്വ) നിസ്ക്‌കരിച്ചിരുന്ന മിഹ്റാബ് നിലവിലുള്ള മിഹ്റാബിൻ്റെ കുറേ പിന്നിലായിരുന്നു. ഉസ്‌മാൻ (റ) പള്ളിയുടെ മുൻഭാഗം വികസിപ്പിച്ചപ്പോൾ സംഭവിച്ചതാണിത്. പള്ളിയുടെ നടുമുറ്റത്ത് ചെറിയൊരു മിഹ്റാബ് കാണാം. ഹിജ്റ വരുമ്പോൾ നബി (സ്വ)യുടെ ഒട്ടകം മുട്ടുകുത്തിയ സ്ഥലമാണിത്.</P>
        `,
        audioSrc: 'https://drive.google.com/file/d/1-KdwnErSUXhBs8yMYNn_TMZHHto7hkcC/preview'
    },
    {
        id: 'arafa',
        topic: 'history',
        keywords: 'അറഫ',
        title: 'അറഫ',
        images: [
            'https://drive.google.com/uc?id=1_yUtrXAyJvUsn5HwVDPPrHg-8sdy-wCX',
            'https://drive.google.com/uc?id=134n3nusnRB6jQqjUUWjj5fjgtvTSGxX8'
        ],
        notes: `
            <P>ഹജ്ജിൻ്റെ ഏറ്റവും പ്രധാനപ്പെട്ട ഘടകമാണ് അറഫ. അറഫ എന്ന പേര് ലഭിച്ചതിൽ വ്യത്യസ്ത അഭിപ്രായങ്ങളുണ്ട്. ജിബ്‌രീൽ (അ) നബി(സ)തങ്ങൾക്ക് ഹജ്ജ് കർമ്മങ്ങൾ വിവരിച്ച് കൊടുക്കുകയും തുടർന്ന് അറഫ്‌ത (മനസ്സിലായോ) എന്ന് ചോദിച്ചപ്പോൾ അവിടെ നിന്ന് അറഫ്‌തു (മനസ്സിലായി) എന്ന് മറുപടി പറഞ്ഞു. ഇതാണ് ഒരഭിപ്രായം, നമ്മുടെ ആദ്യ പിതാവ് ആദംനബി(അ)ഉം ഹവ്വാഅ് ബീവിയും സ്വർഗീയ ലോകത്ത് നിന്ന് ഭൂമിയിലേക്ക് വന്നതിന് ശേഷം ആദ്യമായി കണ്ട്മുട്ടിയത് കൊണ്ടാണ് അറഫ എന്ന പേര് ലഭിച്ചതെന്ന് മറ്റൊരഭിപ്രായം. ഹജ്ജിന് വന്ന മുഴുവൻ ഹാജിമാരും ഒരുമിച്ച് കൂടുന്ന ഇടമാണത്. സമനിരപ്പായ ഭൂമിയാണ് അറഫ. നാല് കിലോമീറ്ററിലധികം നീളവും വീതിയുമുള്ള അറഫക്ക് ചുറ്റും ഒരു വില്ലിന്റെ ആകൃതിയിൽ മലകൾ ചുറ്റിയിരിക്കുകയാണ്. ഹമ്പലി മദ്ഹബ് അല്ലാത്ത മറ്റു മദ്ഹബുകളിൽ അറഫയിൽ നിൽക്കേണ്ട സമയം അറഫ ദിവസം മധ്യാഹ്നം മുതൽ പെരുന്നാൾ ദിവസം ഫജ്റ് വെളിവാകുന്നത് വരെയാണ്. ഹമ്പലി മദ്ഹബിൽ അറഫ ദിവസം ഫജ്റ് വെളിവായത് മുതൽ പെരുന്നാൾ ദിവസത്തെ ഫജ്റ് വരെയാണ്. ബദർ യുദ്ധത്തിന് ശേഷം അറഫ ദിവസമല്ലാതെ ഇത്രയും അപമാനിതനായി ഇബ്‌ലീസിനെ കാണപ്പെട്ടിട്ടില്ലെന്ന് നബി(സ്വ) തങ്ങൾ പറഞ്ഞിട്ടുണ്ട്. അറഫ ദിനത്തിൽ അറഫ ഭൂമിയിൽ ഒരുമിച്ച് കൂടുന്ന മുഴുവൻ ആളുകൾക്കും അല്ലാഹു പൊറുത്തു കൊടുക്കുമെന്നും സ്വർഗം നൽകുമെന്നും ഹദീസിൽ വന്നിട്ടുണ്ട്.</P>
        `,
        audioSrc: 'https://drive.google.com/file/d/1-aT9Ecajb1RVuL3wwCiUve7ZBtEiFtS8/preview'
    },
    {
        id: 'mina',
        topic: 'history',
        keywords: 'മിന',
        title: 'മിന',
        images: [
            'https://drive.google.com/uc?id=1YJzjLjvitPLshXrAmcuvPP209GNBdv95',
            'https://drive.google.com/uc?id=1XFywLAzctJjMd-Kws9GNdX3H1fRhItYe'
        ],
        notes: `
            <P>മക്കയുടെ ഭാഗത്ത് നിന്ന് നോക്കുമ്പോൾ ജംറത്തുൽ അഖബയും മുസ്‌ദലിഫയുടെ ഭാഗത്തിലൂടെ നോക്കുമ്പോൾ വാദി മുഹസ്സറും അതിർത്തിയിടുന്ന സ്ഥലമാണ് മിന. സൂറത്തുൽ കൗസർ അവതീർണ്ണമായത് ഇവിടെ വെച്ചാണ്. നബി(സ്വ) തങ്ങൾ പെരുന്നാൾ ദിവസത്തിലും ദുൽഹിജ്ജ 11നുമായി രണ്ട് പ്രസംഗങ്ങൾ ഇവിടെ വെച്ച് നിർവ്വഹിച്ചിട്ടുണ്ട്. യൗമുത്തർവിയ്യ എന്നാണ് ദുൽ ഹിജ്ജ 8 ന്റെ നാമം.യൗമുന്നഖ്‌ല് എന്നും ഇതിന് പേരുണ്ട്. ഇസ്മാഈൽ (അ) നെ അറുക്കാൻ കൽപിച്ച് കണ്ട സ്വപ്നത്തെ സംബന്ധിച്ച് ഇബ്റാഹീം നബി(അ) ഓർത്ത ദിവസമാണിത്. അബുദ്ദർദാഅ് (റ) വിനെ തൊട്ട് റിപ്പോർട്ട് ചെയ്യുന്ന ഒരു ഹദീസിൽ ഇപ്രകാരം കാണാം. 
ഞങ്ങൾ ചോദിച്ചു: അള്ളാഹുവിൻ്റെ റസൂലേ.. മിനയുടെ കാര്യം അത്ഭുതമാണ്. ഇടുങ്ങിയ ആ ഭൂമിയിൽ ഹാജിമാർ ഇറങ്ങിയപ്പോൾ വിശാലമായി. നബി(സ്വ) പറഞ്ഞു: മിന ഗർഭ പാത്രം പോലെയാണ്. ഗർഭം ധരിക്കുന്ന അവസരത്തിൽ വിശാലമാകും. കഅ്ബാ ശരീഫിൻ്റെ കിഴക്കു ഭാഗത്ത് അൽപം തെക്കോട്ടുമാറിയാണ് മിനയുടെ സ്ഥാനം. ആരോഗ്യമുള്ളവർക്ക് ഹറമിൽ നിന്ന് നടക്കാനുള്ള ദൂരമേയുള്ളൂ. കാൽനട യാത്രക്കാരുടെ സൗകര്യത്തിനായി ഇപ്പോൾ ടണലും പന്തലും സംവിധാനിച്ചിട്ടുണ്ട്. മിനയുടെ തെക്ക് ഭാഗത്ത് മുസ്‌ദലിഫയും അവിടെ നിന്ന് അൽപം കൂടി നീങ്ങിയാൽ അറഫയും സ്ഥിതി ചെയ്യുന്നു.</P>
        `,
        audioSrc: 'https://drive.google.com/file/d/1-g6_hM1KcnFEQpeD7wkLm_vub_8x3Rlx/preview'
    },
    {
        id: 'masjid-an-nabawi',
        topic: 'history',
        keywords: 'മസ്‌ജിദുന്നബവി',
        title: 'മസ്‌ജിദുന്നബവി',
        images: [
            'https://drive.google.com/uc?id=1JfVZ2iTBZBRLenL-Cfgr7toaPY20YsUQ',
            'https://drive.google.com/uc?id=1-H4O1TCh9p58wiO5DfXsROxzc2j8BjX6'
        ],
        notes: `
            <P>ഹിജ്റയുടെ സന്ദര്‍ഭത്തില്‍ നബി(സ്വ) മദീനാശരീഫില്‍ എത്തിയപ്പോള്‍ ഒട്ടകം ആദ്യമായി മുട്ടുകുത്തിയ സ്ഥലത്താണ് അവിടുന്ന് മസ്ജിദുന്നബവി സ്ഥാപിച്ചത്.</P><P>ആദ്യമായി ഒട്ടകം മുട്ടുകുത്തിയ ആ സ്ഥലം ബനൂനജ്ജാര്‍ ഗോത്ത്തിലെ സഹ്ൽ സുഹൈൽ എന്നീ രണ്ട് അനാഥ കുട്ടികളുടേതായിരുന്നു. അവർ സൗജന്യമായി നൽകാമെന്ന് സമ്മതിച്ചെങ്കിലും നബി (സ്വ) അത് വിലക്ക് വാങ്ങി. ഈന്തപ്പനകളും പഴയ കുഴിമാടങ്ങളും വെള്ളം തങ്ങി നിൽക്കുന്ന സ്ഥലവും അടങ്ങിയതായിരുന്നു മസ്‌ജിദുന്നബവി നിൽക്കുന്ന സ്ഥലം. പിന്നീട് ഈന്തപ്പനകൾ മുറിച്ചുമാറ്റി. കുഴിമാടങ്ങൾ തുറന്ന് അവശിഷ്ടങ്ങൾ ദൂരെ കൊണ്ടുപോയി മൂടി. വെള്ളം തിരിച്ചുവിട്ട് ഭൂനിരപ്പാക്കിമാറ്റിയ ശേഷമാണ് നിർമ്മാണം ആരംഭിച്ച ത്. മൂന്ന് മുഴം ഉയരമുള്ള ശിലകൾകൊണ്ടാണ് അടിത്തറ നിർമ്മിച്ചത്. ചുമർ നിർമ്മിച്ചത് ഇഷ്ടികൾകൊണ്ടും. ഒരാൾ പൊക്കമുള്ള ചുമർ. ഈന്തപ്പനമുട്ടികൾകൊണ്ടുള്ള തൂണുകൾ. ഖിബ്‌ല ബൈത്തുൽ മുഖദ്ദസിലേക്കായിരുന്ന കാലത്ത് പുറത്തേക്ക് മൂന്ന് വാതിലുകളുണ്ടായിരുന്നു. ഒന്ന് തെക്ക് ഭാഗത്ത്. ഖിബ്‌ല മാറ്റിയപ്പോൾ ഈ വാതിൽ അടക്കുകയും പകരം വടക്ക് വശത്ത് മറ്റൊരു വാതിൽ തുറക്കുകയും ചെയ്തു. പടിഞ്ഞാറ് ഭാഗത്തായിരുന്നു മറ്റൊരു വാതിലുണ്ടായിരുന്നത്. വേറെയൊന്ന് കിഴക്ക് ഭാഗത്തും. ബാബ് ജിബ്‌രീൽ എന്നാണ് ഈ വാതിലിൻ്റെ നാമം. കല്ലുകളുപോയോഗിച്ചായിരുന്നു വാതിലുകളുടെ നിർമ്മാണം. പള്ളിയുടെ പണി പൂർത്തിയായ മുറക്ക് ആയിശ ബീവിക്കും സൗദ ബീവിക്കും പള്ളിയോട് ചേർന്ന് ഹുജ്‌റകൾ നിർമ്മിച്ചു.</P><P>ഏകദേശം സമചതുരാകൃതിയിൽ മേൽക്കൂരയില്ലാ തെയായിരുന്നു പ്രാഥമിക നിർമ്മാണം. ചരൽപാകിയ മണലിൽ നിസ്കാരവും. എ.ഡി 622ൽ നിർമ്മിക്കപ്പെട്ട ഈ 'പള്ളി നബി(സ്വ)യുടെ കാലത്തെ വികസനമടക്കം ഏഴ് തവണ വികസിപ്പിക്കുകയുണ്ടായി. മസ്‌ജിദ് നിർമ്മിച്ച് ഏഴ് വർഷത്തിന് ശേഷം മസ്ജിദിൻ്റെ വലിപ്പം ഇരട്ടിയാക്കുകയും പള്ളിയോട് ചേർന്ന് കോടതി, മതപഠന കേന്ദ്രം, സാമൂഹിക കേന്ദ്രം എന്നിവയും നിർമിച്ചു. ഉമർ(റ)വിൻ്റെ കാലത്ത് 6 കവാടങ്ങളായി മസ്‌ജിദ് നവീകരിച്ചു. പിന്നീട് ഉസ്‌മാൻ (റ)വിന്റെ കാലത്ത് വീണ്ടും നവീകരിക്കുകയും മസ്‌ജിദിന്റെ ഇഷ്ടികകൾ അറബി ലിപികൊണ്ട് അലങ്കരിക്കുകയും ചെയ്‌തു. കൂടാതെ നിസ്കാരത്തിന് നേതൃത്വം നൽകുന്നവർക്കായി മിഹ്റാബും നിർമിച്ചു. പിന്നീട് അഞ്ചാം ഖലീഫ എന്ന പേരിൽ അറിയപ്പെടുന്ന ഉമർ ബിൻ അബ്‌ദുൽ അസീ സ്(റ)വിന്റെ കൽപ്പനപ്രകാരം മദീന ഗവർണറായിരുന്ന വലീദ് ബിൻ അബ്‌ദുൽ മലിക് പള്ളി നവീകരിച്ചു. പിന്നീട് വന്ന വിവിധ ഭരണാധികാരികൾ പലതവണകളിലായി വിപുലീകരണത്തിന് നേതൃത്വം നൽകി. ഏറ്റവും ബൃഹത്തായ വികസനം ഫഹദ് രാജാവിൻ്റേതായിരുന്നു. മറ്റു വികസനങ്ങളേക്കാൾ ഒൻപത് ഇരട്ടി. ഇപ്പോൾ പള്ളിയിലും ചുറ്റുമുള്ള മുറ്റങ്ങളിലുമായി 698000 പേർക്ക് ഒരേ സമയം നിസ്‌കരിക്കാം. പള്ളി പൂർണ്ണമായും ശീതവത്കൃതമാണ്. പള്ളിക്കുചുറ്റുമുള്ള മുറ്റ ത്തനടിയിൽ 4444 വാഹനങ്ങൾക്ക് പാർക്ക് ചെയ്യാനുള്ള സൗകര്യമുണ്ട്. 135000 ച.മീറ്ററാണ് മുറ്റത്തിന്റെ വിസ്‌തൃതി. 430000 പേർക്ക് ഇവിടെ മാത്രം ഒരേ സമയം നിസ്കരിക്കാം.</P>
        `,
        audioSrc: 'https://drive.google.com/file/d/1-m_EiOMsb6ZJ-Va3c2WOPY5iioGml_1v/preview'
    },
    {
        id: 'masjid-al-haram',
        topic: 'history',
        keywords: 'മസ്ജിദുൽ ഹറാം',
        title: 'മസ്ജിദുൽ ഹറാം',
        images: [
            'https://drive.google.com/uc?id=10-GxMOhE0YbdLoVmNFRRwjlp5MlyYSCF',
            'https://drive.google.com/uc?id=1ie70N0gFCIU4V0hC0CpqXVdu9Z9L4dAW'
        ],
        notes: `
            <P>ലോകത്തിലെ ഏറ്റവും വലിയ പള്ളിയാണ് മക്കയിലുള്ള മസ്ജിദുൽ ഹറാം അഥവാ ഹറം പള്ളി. 3.57 ലക്ഷം ചതുരശ്ര മീറ്റർ വിസ്തീർണമുള്ള ഹറം പള്ളിയുടെ അകത്തും പുറത്തുമായി ഒരേസമയം 40 ലക്ഷത്തോളം പേർക്ക് നിസ്കാരം നിർവഹിക്കാനുള്ള സൗകര്യമുണ്ട്.
ബാബുൽ മലിക് അബ്ദുൽ അസീസ്, ബാബുൽ ഫത്ഹ്, ബാബുൽ ഉംറ എന്നിവയാണ് മസ്ജിദുൽ ഹറമിലേക്കുള പ്രധാന പ്രവേശന കവാടങ്ങൾ. മസ്ജിദുൽ ഹറാമിന് ഒമ്പത് മിനാരങ്ങളാണുള്ളത്. എട്ടെണ്ണവും സ്ഥിതിചെയ്യുന്നത് പ്രധാന പ്രവേശന കവാടങ്ങളിലാണ്. 2.7 മീറ്റർ വ്യാപ്‌തിയുള്ള അടിത്തറയി ലാണ് ഓരോ മിനാരങ്ങളും നിർമിച്ചിരിക്കുന്നത്. ഏറ്റവും വലിയ പള്ളി എന്നതിനു പുറമേ ഭൂമിയിൽ ആദ്യം നിർമ്മിക്കപ്പെട്ട പള്ളി എന്ന വിശേഷണവും മസ്ജിദുൽ ഹറാമിനുണ്ട്. യുദ്ധവും സംഘട്ടനവും എന്നുവേണ്ട, വാക്കുതർക്കങ്ങൾ വരെ നിരോധിച്ച സ്ഥലമാണ് മസ്‌ജിദുൽ ഹറാം. അവിടെ വരുന്നവൻ കറുത്തവനാണെങ്കിലും വെളുത്തവനാണെങ്കിലും പണക്കാരനാണെങ്കിലും പാമരനാണെങ്കിലും എല്ലാവരും ഒരുപോലെ. 
വിശുദ്ധ കഅ്ബാലയവും മത്വാഫും വിശാലമായ നടുത്തളവും അടങ്ങുന്നതാണ് മസ്‌ജിദുൽ ഹറം. ഹറം പള്ളിയുടെ കേന്ദ്രബിന്ദു കഅബയാണ്. കഅബയുടെ പ്രദക്ഷിണ മുറ്റമാണ് ഹറാം പള്ളിയുടെ പ്രധാന ഭാഗം. സന്ദർശിക്കൽ പുണ്യമുള്ള മൂന്ന് പള്ളികളിൽ ഒന്നാണ് മസ്ജിദുൽ ഹറാം.
മസ്ജിദുൽ ഹറാമിലെ ഒരു നിസ്കാരത്തിന് മറ്റു പള്ളികളെക്കാൾ ഒരുലക്ഷം പ്രതിഫലം ലഭിക്കും.</P><P>ഉമർ(റ) ആണ് മസ്‌ജിദുൽ ഹറാമിന് ചുറ്റും ആദ്യമായി ചുമരുകൾ നിർമ്മിച്ചത്. ആദ്യ കാലത്ത് നാലു ഭാഗത്തും വീടുകളായിരുന്നു. നിസ്ക്കരിക്കാൻ ആളുകൾക്ക് സ്ഥലം തികയാതെ വന്നപ്പോൾ അദ്ദേഹം വീടുകൾ വിലക്കെടുത്തു. അങ്ങനെയാണ് ചുമരുകൾ നിർമ്മിക്കുന്നത്. ഒപ്പം വാതിലുകളും സ്ഥാപിച്ചു. അബ്ബാസി ഖലീഫയായിരുന്ന മഹ്‌ദിയുടെ കാലംവരെ കഅ്ബ മസ്‌ജിദുൽ ഹറാമിൻ്റെ മധ്യത്തിലായിരുന്നില്ല. അദ്ദേഹമാണ് അതിനുള്ള ശ്രമങ്ങൾക്ക് ത്യാഗങ്ങൾ സഹിച്ച് നേതൃത്വം നൽകിയത്. ഇപ്പോൾ 95 വാതിലുകളുണ്ട് മസ്‌ജിദുൽ ഹറാമിന്.</P>
        `,
        audioSrc: 'https://drive.google.com/file/d/1-k5lZqqZaPAOU1X3oVjHw0I8lbF-DTr3/preview'
    },
    {
        id: 'jannat-al-baqi',
        topic: 'history',
        keywords: 'ജന്നത്തുൽ ബഖീഅ്',
        title: 'ജന്നത്തുൽ ബഖീഅ്',
        images: [
            'https://drive.google.com/uc?id=1vN-EObUTNnKQX0p0IMUUgXj8q1aATVeM',
            'https://drive.google.com/uc?id=1EAh7OCoro-3nRoSWvsh_NHVGlO8RIxBu'
        ],
        notes: `
            <P>വിവിധ മരങ്ങളുടെ മുരടുകൾ സ്ഥിതിചെയ്യുന്ന ഫലഭൂയിഷ്ഠമായ മൺപ്രദേശമെന്നാണ് ബഖീഇൻ്റെ ഭാഷാർഥം. ഖർഖദ് മരങ്ങൾ ധാരാളമായി വളർന്നിരുന്ന സ്ഥലമായതിനാൽ ഇതിനു ബഖീഉൽ ഖർഖദ് എന്നു വിളിച്ചു. അൻസ്വാരികളിൽനിന്ന് ഉസ്മാനുബ്നു മള്ഊനിനെയാണ് ഇവിടെ ആദ്യമായി മറവുചെയ്യപ്പെട്ടത്. പിന്നീട് മദീനക്കാരുടെ മഖ്ബറ എന്നനിലയിൽ പ്രസിദ്ധമായി മാറി. പൂർവകാലത്ത് മദീനാ പട്ടണാതിർത്തിക്കു പുറത്തായിരുന്നു ബഖീഇൻ്റെ സ്ഥാനം. ഹിജ്റ 1405നു ശേഷം ഫഹദ് രാജാവിൻ്റെ വികസന പ്രവർത്തനങ്ങളുടെ ഫലമായി മസ്‌ജിദുന്നബവിയുടെ തെക്കുകിഴക്കായി അങ്കണത്തോടു ചേർന്നാണ് ഇപ്പോൾ ബഖീഅ് സ്ഥിതിചെയ്യുന്നത്. ധാരാളം മഹാരഥന്മാർ ഇവിടെ അന്ത്യവിശ്രമം കൊള്ളുന്നു.
കർബല യുദ്ധത്തിൽ ശഹീദായ ഹുസൈൻ (റ)വിൻ്റെ ശിരസ്സ് ഇവിടെയാണ് മറവുചെയ്യപ്പെട്ടത്. 
ജന്നത്തുൽ ബഖീഇന് ശ്രേഷ്ഠതകൾ ഏറെയാണ്. പുണ്യനബി (സ്വ) പാതിരാത്രിയിൽ ഇവിടെ വന്ന് പ്രാർഥിക്കാറുണ്ടായിരുന്നു.ഭൂമിയിലുള്ള വർക്ക് സൂര്യ-ചന്ദ്ര പ്രകാശങ്ങൾ ലഭിക്കുന്നതുപോലെ ആകാശവാസികൾക്ക് ജന്നതുൽ ബഖീഅ് തിളങ്ങുന്ന കാഴ്ചയാണെന്ന് ആറ്റലോർ അരുളിയിട്ടുണ്ട്. ജന്നതുൽ ബഖീഇൽ മറവുചെയ്യപ്പെട്ടവർക്ക് നബി (സ്വ) ശഫാഅത്ത് ഉറപ്പുനൽകിയിട്ടുണ്ട്.</P><P>നബി(സ്വ)യുടെ കാലത്ത് ബഖീഇന് 150 മീറ്റർ നീളവും 100 മീറ്റർ വീതിയും മാത്രമെ ഉണ്ടായിരുന്നൊള്ളൂ. പിൽക്കാലത്ത് നടന്ന വികസന പ്രവൃത്തനങ്ങൾ ഫലമായി ഇന്ന് 174962 ച.മീ വിസ്തൃതിയിൽ പരന്നുകിടക്കുകയാണ് ജന്നത്തുൽ ബഖീഅ്.</P>
        `,
        audioSrc: 'https://drive.google.com/file/d/1E_HVnXrb0P-LWBogX224aGveDYg1GV_C/preview'
    },
    {
        id: 'masjid-uthman-ibn-affan',
        topic: 'history',
        keywords: 'മസ്‌ജിദ് ഉസ്‌മാൻബിൻ അഫ്‌ഫാൻ(റ)',
        title: 'മസ്‌ജിദ് ഉസ്‌മാൻബിൻ അഫ്‌ഫാൻ(റ)',
        images: [
            'https://drive.google.com/uc?id=1yNnPrNUQQAyu9t1pKZ-f9sf070k1EY1n',
            'https://drive.google.com/uc?id=1QrxfZ_emDBjowx1hQojVyvzbPKO-YWzQ'
        ],
        notes: `
            <P> മസ്‌ജിദുന്നബവിയുടെ വടക്ക് പടിഞ്ഞാർ ഭാഗത്ത് ശാമീ കവാടത്തിൽ ശാഹാനി സുൽത്താൻ കോട്ടക്കകത്തായിരുന്നു ഈ പള്ളി സ്ഥിതിചെയ്‌തിരുന്നത്. സൈനികർക്ക് നിസ്ക‌രിക്കാനായിരുന്നു ഇത് നിർമിച്ചത്. അടുത്ത കാലത്ത് കോട്ട പൊളിച്ച് മാറ്റിയപ്പോൾ ഈ പള്ളിയും നാമാവശേഷമായിട്ടുണ്ട്. മലിക് അബ്ദു‌ൽ അസീസ് ലൈബ്രറിയുടെ വടക്ക് ഭാഗത്തായിട്ടായിരുന്നു ഇത് സ്ഥിതി ചെയ്തിരുന്നത്.</P>
        `,
        audioSrc: 'https://drive.google.com/file/d/1-Mn5HRVedvJm3Y9BzeVYhT8JgXAUVUKP/preview'
    },
    {
        id: 'masjid-umar-ibn-al-khattab',
        topic: 'history',
        keywords: 'മസ്‌ജിദു ഉമറുബ്‌നുൽ ഖത്താബ്(റ)',
        title: 'മസ്‌ജിദു ഉമറുബ്‌നുൽ ഖത്താബ്(റ)',
        images: [
            'https://drive.google.com/uc?id=1BQBpncIl1I7Fi862153HbfLvu6e3Ez3M',
            'https://drive.google.com/uc?id=10EvFx0rgudV9mNzKlO5inOD9cTJzpGAF'
        ],
        notes: `
            <P>ഇവിടെ വെച്ചാണ് ഹിജ്റ മൂന്നാം വർഷം തിരുനബി(സ) തങ്ങൾ പെരുന്നാൾ നിസ്ക്കാരം നിർവ്വഹിച്ചതെന്ന് കാണാം. മസ്‌ജിദുൽ ഗമാമയുടെ ഖിബ്‌ല ഭാഗത്ത് വാദീ ബഥ്ഹാനിൻ്റെ കിഴക്ക് തീരത്താണിത് സ്ഥിതി ചെയ്യുന്നത്.</P>
        `,
        audioSrc: 'https://drive.google.com/file/d/1-L3dC7JJC2Wy8vPsniRQCJmxz2YJTyum/preview'
    },
    {
        id: 'masjid-abu-bakr',
        topic: 'history',
        keywords: 'മസ്‌ജിദു അബീബക്കർ(റ)',
        title: 'മസ്‌ജിദു അബീബക്കർ(റ)',
        images: [
            'https://drive.google.com/uc?id=1Tl5Ej0VcctGNMK8xzl__Phlp_sXcnUVT',
            'https://drive.google.com/uc?id=13X18COHja_sF1HTjvT1S0Vpe6qxCDoBn'
        ],
        notes: `
            <P>മസ്‌ജിദുൽ ഗമാമയുടെ വടക്ക് പടിഞ്ഞാറ് ഭാഗത്ത് അതികം അകലെയല്ലാതെ സ്ഥിതിചെയ്യുന്ന പള്ളിയാണ് മസ്‌ജിദു അബീബക്കർ(റ). ഈ പള്ളി നബി(സ) തങ്ങൾ പെരുന്നാൾ നിസ്‌കാരം നിർവ്വഹിച്ച സ്ഥലത്ത് നിർമിക്കപ്പെട്ടതാണ്. ഹിജ്റ 6-ാം വർഷമാണ് അവിടുന്ന് പെരുന്നാൾ നിസ്കാരം നിർവ്വ ഹിച്ചതെന്ന് കിതാബുകളിൽ കാണാം.
നബി( സ) തങ്ങളെ മാത്യകയാക്കി അബൂബക്കർ സിദ്ധീഖ് (റ) ഇവിടെ വെച്ച് പെരുന്നാൾ നിസ്‌കാരം നിർവ്വഹിച്ചത് കൊണ്ടാണ് ഇങ്ങനെ പേര് വന്നത്.</P>
        `,
        audioSrc: 'https://drive.google.com/file/d/1-RvHPWThkDGkPzI_Q3626nXzmcxnIbbn/preview'
    },
    {
        id: 'masjid-al-qiblatain',
        topic: 'history',
        keywords: 'മസ്‌ജിദുൽ ഖിബ്‌ലത്തൈനി',
        title: 'മസ്‌ജിദുൽ ഖിബ്‌ലത്തൈനി',
        images: [
            'https://drive.google.com/uc?id=1WmyZzibY8yB-bo38obo2il17ypnCL7Tk',
            'https://drive.google.com/uc?id=10PbyRTRbEAsH4uVs2BIyoGGEMKPF21hv'
        ],
        notes: `
            <P>മസ്‌ജിദുൽ ഖിബ്‌ലത്തൈനി അഥവാ രണ്ട് ഖിബ്‌ലകളുടെ പള്ളി. ഏറെ ചരിത്ര പ്രാധാന്യമുള്ള ഒരു പള്ളിയാണിത്. പ്രസ്തുത പള്ളിക്ക് ഈ പേര് ലഭിച്ചതിൻ്റെ  പിന്നിൽ സംഭവബഹുലമായ ഒരു ചരിത്രമുണ്ട്.
ബനൂസലമ ഗോത്രത്തിലെ ഉമ്മുബിശ്ർ എന്ന വനിതയുടെ രോഗം സന്ദർശിക്കാനെത്തിയതായിരുന്നു നബി(സ്വ). ഹിജ്റ രണ്ടാം വർഷം ശഅ്ബാൻ 15 ചൊവ്വാഴ്ചയായിരുന്നു ഈ സംഭവം. അവർ ഭക്ഷണം നൽകി നബി(സ്വ)യെ സത്‌കരിച്ചു. ളുഹ്റിന് സമയമായപ്പോൾ നബി(സ്വ)യും സ്വഹാബത്തും മസ്‌ജിദു ബനൂസലമയിൽ ഒരുമിച്ചു കൂടി നിസ്കാരം നിർവഹിച്ചു. പതിവുപോലെ ബൈത്തുൽ മുഖദ്ദസിലേക്ക് തിരിഞ്ഞായിരുന്നു നിസ്‌കാരം. മദീനയിൽ വന്നതുമുതൽ പതിനേഴ് മാസക്കാലം ബൈത്തുൽ മുഖദ്ദസിലേക്ക് തിരിഞ്ഞാണ് അവർ നിസ്ക്‌കരിച്ചിരുന്നത്. രണ്ട് റക്അത്ത് പിന്നിട്ടപ്പോൾ ഖിബ്‌ല മാറ്റത്തെ അറിയി ച്ചുകൊണ്ടുള്ള ആയത്തിറങ്ങി. ഉടനെ എല്ലാവരും കഅ്ബയിലേക്ക് തിരിഞ്ഞു. ഒരു നിസ്‌കാരത്തിൽ രണ്ട് ഖിബ്‌ല. അതാണ് മസ്‌ജിദുൽ ഖിബ്‌ലതൈനി.</P>
        `,
        audioSrc: 'https://drive.google.com/file/d/1-GTukS_gxnNDh7ilmf99o7ZmW4vMPQlH/preview'
    },
    {
        id: 'masjid-al-ghamama',
        topic: 'history',
        keywords: 'മസ്ജിദുൽ ഗമാമ',
        title: 'മസ്ജിദുൽ ഗമാമ',
        images: [
            'https://drive.google.com/uc?id=184H5otXXTSpmUrRXPvUvn0oUIQ7PbJMg',
            'https://drive.google.com/uc?id=1xw3_3O_LE8pPdpTpptvFsHsD80LCUmuQ'
        ],
        notes: `
            <P>മസ്‌ജിദുന്നബവിയുടെ പടിഞ്ഞാറ് ഭാഗത്താണ് മസ്ജിദുൽ ഗമാമ സ്ഥിതി ചെയ്യുന്നത്. മസ്‌ജിദുൽ മുസ്വല്ല എന്നും ഇതിന് പേരുണ്ട്. നബി(സ)തങ്ങളുടെ കാലത്ത് പെരുന്നാൾ നിസ്ക്കാരത്തിനും മഴയെ തേടുന്ന നിസ്‌ക്കാരത്തിനും ഉപയോഗിച്ച പള്ളിയായിരുന്നു ഇത്. ഗമാമ എന്നാൽ മേഘം എന്നാണർത്ഥം. ആ സ്ഥലത്ത് വെച്ച് ഒരിക്കൽ നബി (സ) തങ്ങൾ മഴക്ക് വേണ്ടി പ്രാർത്ഥിക്കുകയുണ്ടായി. ശേഷം മേഘം മൂടുകയും മഴ വർഷിക്കുകയും ചെയ്തു. ഇത്കൊണ്ടാണ് ഇതിന് മസ്‌ജിദുൽ ഗമാമ എന്ന പേര് വന്നത്. തിരുനബി(സ) യാത്ര കഴിഞ്ഞ് ഈ വഴി വന്നാൽ ഇവിടെ വെച്ച് ഖിബ്‌ലക്ക് മുന്നിട്ട് പ്രാർത്ഥി ക്കാറുണ്ടായിരുന്നുവെന്ന് ഹദീസുകളിൽ വന്നിട്ടുണ്ട്. ഇവിടെ വെച്ചായിരുന്നു അബ്‌സീനിയയിൽ മരണപ്പെട്ട നജ്ജാശി രാജാവിന് വേണ്ടി നബി(സ)തങ്ങൾ മയ്യിത്ത് നിസ്‌കരിച്ചത്. ഇവിടെ നിന്ന് നോക്കിയാൽ മസ്‌ജിദു അബൂ ബക്കർ സിദ്ധീഖ് എന്ന പള്ളിയും കാണാം.</P>
        `,
        audioSrc: 'https://drive.google.com/file/d/1-U8FU15jpQ04sc6bSyyKtR6Uzy7DKeDY/preview'
    },
    {
        id: 'masjid-al-fath',
        topic: 'history',
        keywords: 'മസ്‌ജിദുൽ ഫത്ഹ്',
        title: 'മസ്‌ജിദുൽ ഫത്ഹ്',
        images: [
            'https://drive.google.com/uc?id=1UkXwC6xM8fVQ1WlkEE6Abwn2isIjt7br',
            'https://drive.google.com/uc?id=14OkplM8xNf14u1InrRivWrfHhlhxBvgS'
        ],
        notes: `
            <P>ഖന്തഖ് കുഴിക്കുന്ന വേളയിൽ നബി(സ)തങ്ങളും സ്വഹാബത്തും താമസിക്കുകയും നിസ്‌കരിക്കുകയും ചെയ്ത സ്ഥലത്ത് ഉമറു ബ്നു അബ്‌ദുൽ അസീസ് നിർമിച്ച പള്ളിയാണിത്. ഖന്തഖിൽ മുസ്‌ലിമീങ്ങൾ വളരെ പ്രയാസപ്പെട്ട അവസരത്തിൽ നബി(സ)തങ്ങൾ സൂജൂദിൽ കിടന്ന് കരഞ്ഞ് പ്രാർത്ഥിച്ചു. തിങ്കൾ മുതൽ ബുധൻ വരെ പ്രാർത്ഥന തുടർന്നു. ബുധനാഴ്ച‌ ളുഹ്റിനും അസ്വറിനും ഇടയിൽ പ്രാർത്ഥനക്ക് ഉത്തരം ലഭിച്ചു. ശത്രുക്കൾ പിന്തിരിഞ്ഞോടി. ഇത് കൊണ്ടാണ് മസ്‌ജിദുൽ ഫത്ഹെന്ന് പേര് വന്നത്.</P>
        `,
        audioSrc: 'https://drive.google.com/file/d/1-Hhw8VrpQg1a9y9JJlIjFq-iOWJegIdb/preview'
    },
    {
        id: 'jabal-abu-qubays',
        topic: 'history',
        keywords: 'ജബലു അബീഖുബൈസ്',
        title: 'ജബലു അബീഖുബൈസ്',
        images: [
            'https://drive.google.com/uc?id=1_rEn3C7ZSQxtoMO_5R_p3v4tEEo_tTux',
            'https://drive.google.com/uc?id=1vZKIBPksCeifW921ld25QLQHcRazTTYF'
        ],
        notes: `
            <P>മക്കയിലെ പ്രധാനപ്പെട്ട രണ്ട് മലകളിലൊന്നാണിത്. മസ്‌ജിദുൽ ഹറാമിൻ്റെയും സ്വഫാ പർവ്വതത്തിന്റെയും മുകളിലായാണ് അത് സ്ഥിതി ചെയ്യുന്നത്. അബൂ ഖുബൈസ് എന്ന് പേരുള്ള വ്യക്തി ആ മലയിൽ താമസമാക്കിയരുന്നത് കൊണ്ടാണ് പിൽക്കാലത്ത് ഈ പേരിൽ അറിയപ്പെട്ടത്. നൂഹ് നബി(അ) ൻ്റെ കാലത്തുണ്ടായ പ്രളയത്തിൽ ഈ മലയിലാണ് 40 വർഷം ഹജറുൽ അസ്‌വദ് സൂക്ഷിക്കപ്പെട്ടിരുന്നത്. അത് കൊണ്ട് അൽഅമീൻ എന്നും ഈ മലക്ക് പേരുണ്ട്. ഹജ്ജിന് വേണ്ടി ജനങ്ങളെ വിളിക്കാൻ ഇബ്റാഹീം നബി(അ) കയറിയതും ഈ മലയിലാണെന്ന് ഹദീസിൽ വന്നിട്ടുണ്ട്. ശത്രുക്കളുടെ വെല്ലുവിളി സ്വീകരിച്ച് നബി(സ) ചന്ദ്രനെ പിളർത്തിയപ്പോൾ അതിൻ്റെ ഒരു ഭാഗം അബൂഖുബൈസ് മലയിലും മറുഭാഗം ഖുദാ മലയിലുമായിരുന്നു.</P>
        `,
        audioSrc: 'https://drive.google.com/file/d/1-69Tzy_nJyzAPs0IetoCP5jQGNTA3ewe/preview'
    },
    {
        id: 'maktaba-makkah-al-mukarramah',
        topic: 'history',
        keywords: 'മക്തബതു മക്കതിൽ മുകർറമ',
        title: 'മക്തബതു മക്കതിൽ മുകർറമ',
        images: [
            'https://drive.google.com/uc?id=1JkZFaImOBs20NqX7VJjg8X4cWMqABvVP',
            'https://drive.google.com/uc?id=1J3TWR1X9fuzeL9Fa_F-Hq_rtGXaR7HEz'
        ],
        notes: `
            <P>ഈ ലൈബ്രറി നിൽക്കുന്ന സ്ഥലത്തായിരുന്നു തിരുനബി(സ) തങ്ങളുടെ ജന്മം കൊണ്ട് അനുഗ്രഹീതമായ വീട് ഉണ്ടായിരുന്നത്. 
53-ാം വയസ്സിൽ ഹിജ്റ പോകുമ്പോൾ പിതൃവ്യപു ത്രൻ ഉഖൈലിനാണ് നബി(സ) തന്റെ വീട് നൽകിയത്. ഉഖൈലിൻ്റെ മരണ ശേഷം മകൻ ആ വീട് ഹജ്ജാജുബ്നു യൂസുഫിൻ്റെ സഹോദരൻ മുഹമ്മദുബ്‌നു യൂസുഫിന് നൽകി. അദ്ദേഹം ആ വീട് തൻ്റെ വീടിൻ്റെ അകത്താക്കി വികസിപ്പിച്ചു. ഹിജ്റ 171ൽ ഹാറൂൻ റഷീദിൻ്റെ ഉമ്മ ഖീസറാൻ ഹജ്ജിന് പോയപ്പോൾ തിരുനബി ജനിച്ച വീടിനെ ഹജ്ജാജ്ബ്‌നു യൂസുഫിൻ്റെ വീടിന് പുറത്താക്കു കയും നിസ്ക്കരിക്കാൻ സൗകര്യമുള്ള ഒരു പള്ളിയായി അത് വിശാലമാക്കുകയും ചെയ്‌തു. ഹിജ്‌റ 1370 ജമാദുൽ അവ്വൽ മാസത്തിലാണ് ശൈഖ് അബ്ബാസ് അൽ ഖത്താൻ അവിടെ ഒരു ലൈബ്രറി ഉണ്ടാക്കാൻ അബ്ദുൽ അസീസ് രാജാവിനോട് അനുവാദം വാങ്ങിയത്.</P>
        `,
        audioSrc: 'https://drive.google.com/file/d/1DddJrVdQv2M7qDPOihkzSdqzO_z5D-qG/preview'
    },
    {
        id: 'hudaybiyyah',
        topic: 'history',
        keywords: 'ഹുദൈബിയ്യ',
        title: 'ഹുദൈബിയ്യ',
        images: [
            'https://drive.google.com/uc?id=1Tl45If-5zDLSWTjEP6eBnMcJsn9VxpZm',
            'https://drive.google.com/uc?id=1o5x9KcHNUxZ3BQzawFZCUwZvJBZpM7bz'
        ],
        notes: `
            <P>ഹുദൈബിയ്യ മസ്‌ജിദുൽ ഹറാമിൽ നിന്ന് 26 കി.മീ ആണ് ദൂരം. ഹുദൈബിയ്യ ഒരു കിണറിൻ്റെ പേരായിരുന്നു. ഈ പേരിലാണ് പിന്നീട് ഈ സ്ഥലം അറിയപ്പെട്ടത്.</P><P>ഹിജ്റ 6 ൽ ദുൽഖഅ്ദ് ആദ്യത്തിലെ ഒരു തിങ്കളാഴ്‌ച നബി (സ) തങ്ങളും സ്വഹാബികളും ഉംറ നിർവ്വഹിക്കാനായി മദീനയിൽ നിന്ന് മക്കയിലേക്ക് പുറപ്പെട്ടു. അതിർത്തിയായ ഹുദൈബിയ്യയിലെത്തിയപ്പോൾ ഖുറൈശികൾ അവരെ തടഞ്ഞു. മക്കയിലുള്ള ഖുറൈശി നേതാക്കളുമായി സംസാരിക്കാൻ നബി(സ)ഉസ്‌മാൻ(റ)വിനെ മക്കയിലേക്കയച്ചു. ഉസ്‌മാൻ(റ)വിൻ്റെ ബന്ധുക്കൾ മക്കയിലുണ്ടാ യിരുന്നു. ഉസ്‌മാൻ(റ)മക്കയിലെത്തി. ആഗമനോദ്ദേശ്യം ഖുറൈശികളെ അറിയിച്ചു. അവർ പറഞ്ഞു. “നീ പറഞ്ഞത് ഞങ്ങൾ കേട്ടു. ഇനി നിന്റെ ആവശ്യങ്ങൾക്കായി പോകാം”. ഉസ്മാൻ(റ)വിന് കഅ്ബ ത്വവാഫ് ചെയ്യാൻ അനുമതി നൽകി. പക്ഷെ, അത് നിരസിച്ചു അദ്ദേഹം പറഞ്ഞു: “അല്ലാഹുവിന്റെ പ്രവാചകർ മുഹമ്മദ് നബി(സ) ത്വവാഫ് ചെയ്യുന്നത് വരെ ഞാൻ ത്വവാഫ് ചെയ്യില്ല". അവർ അദ്ദേഹത്തെ തടവിലാക്കി. ഇതോടെ ഉസ്‌മാൻ(റ) വധിക്കപ്പെട്ടുവെന്ന് മുസ്ലിംകൾക്കിടയിൽ വാർത്ത പ്രചരിച്ചു. അങ്ങനെയെങ്കിൽ മരണം വരെ ഞങ്ങൾ ഖുറൈശികളോട് പോരാടുമെന്ന് സ്വഹാബികൾ നബി(സ) തങ്ങളോട് ബൈഅത്ത് ചെയ്തു‌. ഈ ബൈഅത്താണ് 'ബൈഅത്തു രിള്‌വാൻ' എന്ന പേരിൽ അറിയപ്പെടുന്നത്. പ്രതിജ്ഞയുടെ നടപടികളെല്ലാം പൂർത്തിയായതോടെ ഉസ്മാൻ(റ) തിരിച്ചെത്തി. ഉസ്മാൻ(റ)വും പ്രതിജ്ഞയിൽ പങ്കെടുത്തു. ഈ പ്രതിജ്ഞ ഒരു വൃക്ഷച്ചുവട്ടിൽ വെച്ചായിരുന്നു നടന്നത്. ആ വൃക്ഷം നിന്ന സ്ഥലത്ത് എടുപ്പുകൾ കാണാം. പ്രതിജ്ഞയുടെ ഗൗരവം മനസ്സിലാക്കിയ ഖുറൈ ശികൾ ഉടനെത്തന്നെ ഒരു സന്ധി സന്ദേശവുമായി വക്ര ബുദ്ധിക്കാരനായ സുഹൈൽബിൻ അംറിനെ തിരുസന്നിധിയിലേക്കയച്ചു. സുഹൈലിൻ്റെ ആഗമനം കണ്ടപ്പോൾ തന്നെ പ്രവാചകർ പറഞ്ഞു, നിങ്ങൾക്ക് കാര്യം എളുപ്പമായിരിക്കുന്നു, സുഹൈൽ പുണ്യറസൂലിൻ്റെ അടുത്തേക്ക് വന്നു. ദീർഘമായി സന്ധിയെക്കുറിച്ച് സംസാരിച്ചു. അവസാനം പ്രധാന നാല് വിഷയങ്ങളിൽ സന്ധിയിലെത്തി. 
1.⁠ ⁠ഈവർഷം പ്രവാചകരും സ്വഹാബത്തും ഉംറ നിർവ്വഹിക്കാതെ മടങ്ങിപ്പോവുകയും അടുത്ത വർഷം മുസ്ലിംകൾക്ക് മക്കയിൽ വരാമെന്നും മൂന്ന് ദിവസം താമസിക്കാമെന്നും പറഞ്ഞു. കൂടെ ഉറയിലിട്ട വാളല്ലാതെ മറ്റൊന്നും പാടില്ലെന്നും പറഞ്ഞു.
2.⁠ ⁠പത്ത് വർഷത്തേക്ക് ഇരു കക്ഷികളും യുദ്ധം പാടില്ല
3.⁠ ⁠നബി(സ)തങ്ങളുമായി സഖ്യത്തിലേർപ്പെടാൻ താൽപര്യപ്പെടുന്ന ഗോത്രങ്ങൾക്ക് അതിനും ഖുറൈശികളുമായി സഖ്യത്തിലേർപ്പെടാൻ താൽപര്യമുള്ളവർക്ക് അതിനും അവസരം ഉണ്ടായിരിക്കുന്നതാണ്. ഈ ഗോത്രങ്ങൾക്കെതിരെ നടത്തുന്ന കയ്യേറ്റം ആ വിഭാഗത്തിനെതിരെയുള്ള കയ്യേറ്റമായിട്ടാണ് പരിഗണിക്കുക. 
4.⁠ ⁠ഖുറൈശികളിൽ നിന്ന് ആരെങ്കിലും മുഹമ്മദിന്റെ പക്ഷത്തേക്ക് ഒളിച്ചോടിയാൽ അവരെ തിരിച്ചയക്കണമെന്നും മറിച്ച് ഇവിടെ നിന്ന് ആരെങ്കിലും ഖുറൈശി പക്ഷത്ത് എത്തുന്നവരെ തിരിച്ചയക്കുകയില്ല എന്നുമാണ് പ്രധാന സന്ധിവ്യവസ്ഥകൾ.
ഇത് കേട്ട സ്വഹാബികൾ കോപാകുലരായി. പക്ഷെ, തിരുനബി(സ) അവരെ സമാശ്വസിപ്പിച്ചു. അവസാന വിജയം നമുക്കൊപ്പമാണെന്ന് പ്രഖ്യാപിച്ചു. സ്വഹാബികൾ ശാന്തരായി. തുടർന്ന് ഇത് രേഖപ്പെടുത്താനായി അലി(റ) വിനോട് ആവശ്യപ്പെട്ടു. റഹ്‌മാനും റഹീമുമായ അല്ലാഹുവിൻ്റെ നാമത്തിൽ എന്ന് പ്രവാചകർ ചൊല്ലിക്കൊടുത്തപ്പോൾ സുഹൈൽ അതിനെ എതിർത്തു. അപ്പോൾ പ്രവാചകർ പറഞ്ഞു:  'അല്ലാഹുവിൻ്റെ നാമത്തിൽ എന്നെഴുതുക. അത് മതി.' പിന്നീട് അല്ലാഹുവിൻ്റെ ദൂതൻ മുഹമ്മദിൽ നിന്നുള്ള സന്ധി എന്ന് എഴുതാനാവശ്യപ്പെട്ടപ്പോൾ സുഹൈൽ വീണ്ടും ഇടപെട്ടു. താങ്കൾ അല്ലാഹുവിൻ്റ ദൂതനാണെന്ന് ഞങ്ങൾ അംഗീകരിക്കുന്നെങ്കിൽപ്പിന്നെ ഈ സന്ധികൊണ്ട് എന്ത് പ്രയോജനം?. 'നിങ്ങൾ അംഗീകരിച്ചില്ലെങ്കിലും ഞാൻ അല്ലാഹു വിൻ്റെ ദൂതൻ തന്നെയാണ് തീർച്ച.' തുടർന്ന് പ്രവാചകർ(സ)അബ്‌ദുല്ലയുടെ പുത്രൻ മുഹമ്മദ് എന്നെഴുതാൻ കൽപിച്ചു. പക്ഷെ, അലി(റ)കൂട്ടാക്കിയില്ല. തുടർന്ന് പുണ്യപ്രവാചകർ തന്നെ അങ്ങനെ എഴുതുകയും കരാർ പൂർത്തിയാ ക്കുകയും ചെയ്‌തു. സന്ധിവ്യവസ്ഥ എഴുതിത്തീരും മുമ്പ് സുഹൈലിന്റെ പുത്രൻ അബൂജന്ദൽ മുസ്‌ലിം പക്ഷത്തേക്ക് കടന്നുവന്നു. ഉടനെ സന്ധിപ്രകാരം ഇവനെ തിരിച്ച് തരണമെന്ന് സുഹൈൽ ആവശ്യപ്പെട്ടു. നബി(സ)തങ്ങൾ പറഞ്ഞു, 'സന്ധി പൂർത്തിയാകാത്ത സ്ഥിതിക്ക് അവനെ തിരിച്ചുതരേണ്ട ആവശ്യമില്ല'.
 'എന്നാൽ ഒരിക്കലും ഒരു കരാറിനും ഞങ്ങൾ വഴിപ്പെടില്ല.' സുഹൈൽ പറഞ്ഞു.
തിരുനബി (സ) തൽക്കാലം അബൂജന്ദലിനെ വിട്ടുകൊടുത്തു. സുഹൈൽ മകനായ ജൻദലിനെ പിടിച്ചുവലിച്ച് മുഖത്ത് തൊഴിച്ച് കൊണ്ടുപോവുകയാണ്. ജൻദൽ ആർത്തുവിളിച്ചു. വേദന സഹിക്കവയ്യാതെ പുളഞ്ഞു മറിഞ്ഞു. തിരുനബിക്ക് നേരെ മിഴിയെറിഞ്ഞു. കൈവിടരുതെന്ന അപേക്ഷ, രക്ഷിക്കുമെന്ന പ്രതീക്ഷ.
"ജൻദൽ, നല്ല പുലരികൾ തീർച്ചയായും കടന്നുവരും അല്ലാഹു ഒരു പോംവഴിയുണ്ടാക്കിത്തരും." ഹബീബ് ആശ്വാസ വാക്കുകൾ മൊഴിഞ്ഞു. പിൽകാലത്ത് തിരുനബിയോടൊപ്പം ചേർന്ന് ജീവിതയാമങ്ങളെ ജീവസ്സുറ്റതാക്കി മാറ്റാൻ ജൻദലിന് സാധിച്ചു. തിരുനബിയുടെ ദീർഘ ദർശനത്തിൻ്റെ ഉദയങ്ങൾ. ചരിത്രം വരിയിടറാതെ കുറിച്ചുവെച്ച അനർഘനിമിഷങ്ങൾ. കരാറിൽ നിന്ന് വിരമിച്ചതോടെ നബി(സ) അനുചരരോട് പറഞ്ഞു: "ഉംറക്ക് വേണ്ടി ഇഹ്റാം ചെയ്യുകയും അതിന് സാധിക്കാതെ വരികയും ചെയ്തതിനാൽ എല്ലാവരും ബലി നടത്തുക." പ്രവാചകർ മൂന്ന് തവണ ആവർത്തിച്ചെങ്കിലും മാനസിക സംഘർഷം കാരണം ആർക്കും തിരുകൽപന പെട്ടെന്ന് ഉൾക്കൊള്ളാൻ സാധിച്ചില്ല. അവസാനം പ്രവാചകർ തന്നെ ബലിക്ക് നേതൃത്വം നൽകി. അനുചരരെല്ലാം അതനുഗമിച്ചു. അങ്ങനെയവർ ഉംറ നിർവ്വഹിക്കാതെ മദീനയിലേക്ക് തിരിച്ചുപോയി. അടുത്തവർഷം പ്രവാചകരും സ്വഹാബത്തും മക്കയിലെത്തുകയും ഉംറ നിർവ്വഹിക്കുകയും ചെയ്തു. ഇസ്‌ലാമിൻ്റെ മുന്നേറ്റത്തിൽ ഹുദൈബിയ്യയുടെ സ്ഥാനം ചെറുതൊന്നുമല്ല. മക്കം ഫത്ഹിന്റെ പ്രധാന നിദാനങ്ങളിലൊന്ന് ഹുദൈബിയ്യ സന്ധിയുടെ അനുരണനങ്ങളായിരുന്നു എന്നത് ചരിത്രം.
മുത്ത് നബിയുടെ മുഅ്ജിസത്തിന് സാക്ഷ്യം വഹിച്ച ഭൂമിയാണ് ഹുദൈബിയ്യ.
ജാബിർ(റ) പറയുന്നു: നബി(സ)ഹൂദൈബിയ്യയിൽ ഇരിക്കുന്നു. മുന്നിൽ ഒരു തോൽപാത്രമുണ്ട്. അൽപ്പം വെള്ളമേ അതിലുള്ളൂ. സ്വഹാബത്തെല്ലാം ശക്തമായ ദാഹത്തിലുമാണ്. അവർ മുത്ത് നബിയോട് വിഷമം പറഞ്ഞു. ഉടനെ തൻ്റെ തിരുകരങ്ങൾ മുത്ത് നബി ആ പാത്രത്തിൽ വെച്ചു. കൈവിരലുകൾക്കിടയിൽ നിന്ന് വെള്ളം ഉറവ പൊട്ടി. സ്വഹാബത്തിന് അടങ്ങാത്ത സന്തോഷം. ഈ ഹദീസ് പറഞ്ഞുകൊടുക്കുമ്പോൾ ഒരാൾ ജാബിർ(റ)വിനോട് ചോദിച്ചുവത്രെ. നിങ്ങൾ എത്ര പേരുണ്ടായിരുന്നു?. ആയിരത്തിയഞ്ഞൂറ് പേർ, പതിനായിരം പേരുണ്ട ങ്കിൽ അവർക്കും തികയുമായിരുന്നു. ജാബിർ(റ)പറഞ്ഞു.</P>
        `,
        audioSrc: 'https://drive.google.com/file/d/1VnJqut9BXwLHr_afrDxtD1EYATJwhnM4/preview'
    },
    {
        id: 'clock-tower',
        topic: 'history',
        keywords: 'ക്ലോക്ക് ടവർ',
        title: 'ക്ലോക്ക് ടവർ',
        images: [
            'https://drive.google.com/uc?id=1PeUsTXXmEQ9LAHGuzaEtc0VxNXzwRYKw',
            'https://drive.google.com/uc?id=12lDck5A8fYaL8Rpvln0Rl2gSCd_uRjkx'
        ],
        notes: `
            <P>ലോകത്തിലെ ഏറ്റവും വലിയ സമയഗോപുരമാണിത്. ലണ്ടൻ ടവറിലുള്ള ബിഗ്ബൻ വാച്ചിന്റെ ആറ് ഇരട്ടി വലിപ്പമാണ് ടവറിനുള്ളത്. നാല് വശത്തുമുള്ള ക്ലോക്കുകളിൽ രണ്ടെണ്ണത്തിന് 80 മീറ്റർ ഉയരവും 65 മീറ്റർ വീതിയും 39 മീറ്റർ വ്യാസവുമുണ്ട്. മറ്റു രണ്ടെണ്ണത്തിന് 80മീറ്റർ ഉയരവും 65 മീറ്റർ വീതിയും 25 മീറ്റർ വ്യാസവും. അതുകൊണ്ട് തന്നെയാണ് മുപ്പത് കി.മീ അകലെ നിന്നും ഇത് കാണാനാവുന്നത്. മുപ്പ ത്തിയാറായിരം ടൺ ആണ് ക്ലോക്കിന്റെ തൂക്കം. ആറ് ടൺ വീതം തൂക്കമുള്ള ക്ലോക്കിലെ മിനിട്ട് സൂചികൾക്ക് 22 മീറ്ററും മണിക്കൂർ സൂചിക്ക് 17 മീറ്ററും നീളമുണ്ട്. എന്തൊരാശ്ചര്യമാണിത്!. ക്ലോക്കിന്റെ മുകളിലെ അല്ലാഹു അക്ബർ എന്ന വാക്കിലെ ആദ്യാക്ഷരത്തിന് 23 മീറ്ററിലധികം ഉയരമുണ്ടമത്രെ.</P><P>ഭൂപ്രതലത്തിൽ നിന്ന് 400 മീറ്ററിലധികം ഉയരത്തി ലാണ് ക്ലോക്ക് ടവർ സ്ഥിതി ചെയ്യുന്നത്. ക്ലോക്കുകൾക്ക് മുകളിൽ സ്ഥാപിച്ചിരിക്കുന്ന ഉച്ച ഭാഷിണിയിലൂടെ ഏഴ് കി.മീ ദൂരം ഹറമിൽ നിന്നുള്ള ബാങ്ക് വിളി കേൾക്കാൻ സാധിക്കും. ടവറിന് മുകളിലെ നക്ഷത്രക്കലക്കും നിരവധി പ്രത്യേകതകളുണ്ട്. ലോകത്തെ ഏറ്റവും വലിയ നക്ഷത്രക്കലയും സ്വർണ മിനാരവുമാണിത്. അതിന് തൊട്ടുചാരിയാണ് മസ്‌ജിദുൽ ഹറാം സ്ഥിതി ചെയ്യുന്നത്.</P>
        `,
        audioSrc: 'https://drive.google.com/file/d/1-72PeYpYR5iki3p3cHB6jNdp2HxsuHSx/preview'
    },
    {
        id: 'golden-spout',
        topic: 'history',
        keywords: 'സ്വർണ്ണപ്പാത്തി',
        title: 'സ്വർണ്ണപ്പാത്തി',
        images: [
            'https://drive.google.com/uc?id=1GICp2zOGPWi5Q-BG46R2AbV8tzCKBXa-',
            'https://drive.google.com/uc?id=1_fuIQ1KKGvb6_coOUg141ePkBEmlZCmG'
        ],
        notes: `
            <P>ഖുറൈശികളുടെ കഅ്ബാ പുനർനിർമ്മാണ വേളയിൽ സ്ഥാപിച്ച മീസാബാണിത്. മഴ വെള്ളം, കഅ്ബയെ കഴുകുന്ന വെള്ളം എന്നിവ താഴോട്ടൊഴുക്കാൻ ഹിജ്‌റിൻ്റെ മുകളിൽ വരുന്ന രൂപത്തിൽ കഅ്ബക്ക് മുകളിൽ സ്ഥാപിച്ചതാണ് ഈ സ്വർണ്ണപ്പാത്തി. ഇതിൻ്റെ മുകളിൽ പക്ഷികളിരിക്കുന്നത് തടയാൻ ആണിയടിച്ചിട്ടുണ്ട്.</P><P>
ധാരാളം മഹാരഥന്മാർ ഇതിൻ്റെ ശ്രേഷ്ഠതയെക്കുറിച്ച് വാചാലമായിട്ടുണ്ട്.
അത്വാഅ്ബ്നു അബീ റബാഹ് (റ) പറയുന്നു:
ഈ പാത്തിയുടെ താഴെ വെച്ച് ദുആ ചെയ്യുന്നവൻ ഉമ്മ പ്രസവിച്ച ദിവസത്തെപ്പോലെ പാപ മോചിതനാവും. (അഖ്ബാറു മക്ക)</P><P>
ഇബ്നു അബ്ബാസ്(റ) പറഞ്ഞത് നല്ലവരുടെ നി സ്ക്കാരം നിസ്ക്കരിക്കാനും നല്ലവരുടെ പാനീയം കൂടിക്കാനുമാണ്. ഏതാണ് നല്ലവരുടെ നിസ്ക്കാരമെന്ന് ചോദിക്കപ്പെട്ടപ്പോൾ അദ്ദേഹം പറഞ്ഞു: സ്വർണ്ണപ്പാത്തിക്ക് താഴെയുള്ള നിസ്ക്കാരമാണ്. നല്ലവരുടെ പാനീയം സംസമുമാണ്.</P><P>
മൂന്നാം ഖലീഫ ഉസ്‌മാൻ(റ) ഒരിക്കൽ കൂടെയു ള്ളവരോട് ചോദിച്ചു: ഞാനെവിടെ നിന്ന് വരുന്നു എന്ന് നിങ്ങളെന്താണ് ചോദിക്കാത്തത്?
അവർ ചോദിച്ചപ്പോൾ അവിടുന്ന് പറഞ്ഞു: ഞാൻ സ്വർഗത്തിൻ്റെ കവാടത്തിൽ നിൽക്കുകയായിരുന്നു. ഇത്രയേറെ മഹത്വമുള്ള സ്വർണപ്പാത്തിക്ക് താഴെ പ്രാർത്ഥിച്ചാൽ ഉത്തരം ലഭിക്കുമെന്നത് തീർച്ചയാണ്.</P>
        `,
        audioSrc: 'https://drive.google.com/file/d/1-3zhWvyK6BW50MTfMaTXz9QFpCxEr1LB/preview'
    },
];